Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2263b10-6e57-46cf-b47e-55d2a0ece65c">
  <name>торо_ТиповыеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a539d3d0-780d-4225-9a49-5758a63c542a">
    <name>гкс_Модель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Статус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Качество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3c1c3c2d-feea-4d32-8161-3307cc6b0663">
    <name>гкс_КонструктивныйСостав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fe3986cf-990b-463d-b2d8-8fbd42506576">
      <name>Компонент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ababde59-2f1f-44a7-98d4-08f7899e312e">
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4cef263b-5fa1-4863-818a-7dfb0891cf97">
    <name>КоэффициентИспользованияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2aa2e5d9-99b7-4aba-8716-37d996878c7e">
    <name>ПлановаяНаработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="2598d42a-db9a-42dd-8af0-040759d58fe4">
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b2680aea-45f2-4122-b381-f641cc7278cd">
    <name>ПериодПлановойНаработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6ecb2c69-db21-4ac7-8084-4d21792f236c">
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="78bf5c81-9b48-4bd0-8822-8511e69534ae">
    <name>гкс_ЗначениеУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="9e6aaa8d-44c6-4d35-804f-6ada915a8d5a">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="da33cd30-a753-4d97-bcb2-e229a3856fa6">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Периодичность</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="473b2fa8-99d9-4792-a6b8-e458d7079650">
    <name>День</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75346382-d059-4b8c-b2b7-a18ca56176f2">
    <name>Неделя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2360f632-dc4d-4464-8c3c-855804dc7e36">
    <name>Полугодие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a367ecfc-7135-485a-9f99-bc5553ddb898">
    <name>Месяц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2712affc-b7ac-44a4-8973-8b9e94a64b14">
    <name>Год</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1050b47-3d75-4dc7-a340-fc03a54222fa">
    <name>Квартал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПланГрафикРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>ПланРемонтов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз 1] Куст 17.03.2020
	дс_ПриСозданииНаСервере();
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект;
	КонецЕсли;
	ДобавитьНовыеЭлементы();
	// гкс-[Релиз 1] Куст 17.03.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Релиз 1] Куст 17.03.2020
	Если ЭтотОбъект["МодифицированностьОграничений"] Тогда 
		ЗаписатьДеревоОграничений(ТекущийОбъект);
		ЭтотОбъект["МодифицированностьОграничений"] = Ложь;
	КонецЕсли;
	дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	// гкс- [Релиз 1] Куст 17.03.2020
КонецПроцедуры

&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура дс_ПриСозданииНаСервере()
	//СтроковыеРеквизиты = "Наименование,Изготовитель,Комментарий,гкс_Модель";
	СтроковыеРеквизиты = "Наименование,Комментарий,гкс_Модель";
	торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);
КонецПроцедуры 

&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура Расш_гкс_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Релиз 1] Куст 19.03.2020
	дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// гкс- [Релиз 1] Куст 19.03.2020
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Не Отказ Тогда
		Если (МодифицированностьНормРемонтов Или МодифицированностьЗамещаемыхРемонтов Или  МодифицированностьПредшествующихРемонтов)
			И ЗначениеЗаполнено(ВРНачалоЦикла) Тогда

			Элементы.Перерасчитать.Доступность 	= Ложь;
			Элементы.Построить.Доступность 		= Ложь;
			Элементы.Настройки.Доступность 		= Ложь; 			

			ВРНачалоЦикла = Неопределено;
			ПлановыйГрафикРаботы = Неопределено;
			торо_РаботаСМнемосхемами.мнс_СоздатьЧистуюКарту(ПолеМнемосхемы);
			ОчиститьПолеТабличногоДокумента();
			Элементы.Декорация1.Заголовок		= НСтр("es='En total ';ru='Всего: ';en='Total: '");

			ТекстСообщения = НСтр("es='Los datos en вкладке <la Estructura del ciclo de reparación> eran limpiados, puesto que las normas son cambiadas.';ru='Данные на вкладке <Структура ремонтного цикла> были очищены, так как нормативы изменены.';en='The data on the <Структура ремонтного цикла> tab has been cleared because the specifications have been changed.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			#Вставка
			Если ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] Тогда 
				Если ЗначениеЗаполнено(Объект.ТипОбъекта) = Ложь Тогда 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru = 'Не указан тип объекта!'; 
						|en = 'Do not specify the type of object!'; es = 'No se especifica el tipo de objeto!'");
					Сообщение.Поле = "Объект.ТипОбъекта";
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
			#КонецВставки
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ФункциональныеМеста
// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	Элементы.НормативныеРемонтыНормативныйРемонт.РедактированиеТекста = Ложь;
	Элементы.НормативныеРемонтыНормативныйРемонт.БыстрыйВыбор = Ложь;
	Элементы.НормативныеРемонтыНормативныйРемонт.КнопкаСоздания = Ложь;
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ФОИспользоватьФункциональныеМеста", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("МодифицированностьОграничений", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ПредыдущийТипОбъекта",
		Новый ОписаниеТипов("ПеречислениеСсылка.торо_ТипыОбъектовRCM")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаОграничений", Новый ОписаниеТипов("ДеревоЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Иерархия", Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"),
		"ТаблицаОграничений", НСтр("ru = 'Иерархия'; en = 'Hierarchy'; es = 'La jerarquía de'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Ограничение",
		Новый ОписаниеТипов("СправочникСсылка.торо_ОграниченияНаХарактеристикиОбрудования"),
		"ТаблицаОграничений", НСтр("en='Rrestriction';es='La limitación de la';ru='Ограничение'")));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] = Константы.торо_ИспользоватьФункциональныеМеста.Получить();
	ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта;
	//
	НЭлем = Элементы.Добавить("ГруппаРодительТип", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	Элементы.Переместить(Элементы["ГруппаРодительТип"], ЭтаФорма,Элементы.КодИНаименование);
	Элементы.Переместить(Элементы.Родитель, Элементы["ГруппаРодительТип"],);
	//
	НЭлем = Элементы.Добавить("ТипОбъекта", Тип("ПолеФормы"), Элементы["ГруппаРодительТип"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.РежимВыбораИзСписка = Истина;
	НЭлем.ПутьКДанным = "Объект.ТипОбъекта";
	НЭлем.СписокВыбора.Добавить(Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
	НЭлем.СписокВыбора.Добавить(Перечисления.торо_ТипыОбъектовRCM.Объект);
	НЭлем.Видимость = ЭтотОбъект["ФОИспользоватьФункциональныеМеста"];
	НЭлем.УстановитьДействие("ПриИзменении", "ТипОбъекта_ПриИзменении");
	//
	нСтран = Элементы.Добавить("Страница_Ограничения", Тип("ГруппаФормы"), Элементы["ПанельДопИнформации"]);
	нСтран.Вид = ВидГруппыФормы.Страница;
	нСтран.Заголовок = НСтр("en='Rrestriction';es='La limitación de la';ru='Ограничение'");
	//
	НЭлем = Элементы.Добавить("ГруппаКомандыОграничений", Тип("ГруппаФормы"), Элементы["Страница_Ограничения"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	нТабл = Элементы.Добавить("ТаблицаОграничений", Тип("ТаблицаФормы"), Элементы["Страница_Ограничения"]);
	нТабл.ПутьКДанным = "ТаблицаОграничений";
	нТабл.Отображение = ОтображениеТаблицы.Дерево;
	нТабл.КоманднаяПанель.Видимость = Ложь;
	нТабл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	нТабл.УстановитьДействие("ПередУдалением", "ТаблицаОграничений_ПередУдалением");
	нТабл.УстановитьДействие("ПередНачаломДобавления", "ТаблицаОграничений_ПередНачаломДобавления");
	нТабл.УстановитьДействие("Выбор", "Ограничения_Выбор");
	
	НЭлем = Элементы.Добавить("Ограничения_Иерархия", Тип("ПолеФормы"), Элементы["ТаблицаОграничений"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТаблицаОграничений.Иерархия";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("Ограничения_Ограничение", Тип("ПолеФормы"), Элементы["ТаблицаОграничений"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТаблицаОграничений.Ограничение";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.УстановитьДействие("ПриИзменении", "Ограничения_Ограничение_ПриИзменении");
	НЭлем.ТолькоПросмотр = Истина;
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьИерархию");
	НКом.Действие = "Ограничения_ДобавитьИерархию";
	НКом.Заголовок = НСтр("ru = 'Добавить иерархию'; en = 'To add a hierarchy'; es = 'Añadir la jerarquía'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьИерархию", Тип("КнопкаФормы"),
		Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьИерархию";
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьОграничение");
	НКом.Действие = "Ограничения_ДобавитьОграничение";
	НКом.Заголовок = НСтр("ru = 'Добавить ограничение'; en = 'Add constraint'; es = 'Agregar la restricción'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьОграничение", Тип("КнопкаФормы"),
		Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьОграничение";
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьОграничениеВсем");
	НКом.Действие = "Ограничения_ДобавитьОграничениеВсем";
	НКом.Заголовок = НСтр("ru = 'Добавить ограничение для всех';
		|en = 'Add constraint for all'; es = 'Agregar una restricción para todos'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьОграничениеВсем", Тип("КнопкаФормы"), 
		Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьОграничениеВсем";
	//
	Элементы.Наименование.Заголовок = НСтр("ru='Модель';en='Model'");
	//
	НЭлем = Элементы.Добавить("гкс_Модель", Тип("ПолеФормы"), Элементы.КодИНаименование);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Заголовок = НСтр("ru='Наименование';en='Name'");
	НЭлем.ПутьКДанным = "Объект.гкс_Модель";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ТолькоПросмотр = Истина;
	Элементы.Наименование.УстановитьДействие("ПриИзменении", "МодельПриИзменении");
	Элементы.Комментарий.УстановитьДействие("ПриИзменении", "МодельПриИзменении");
	Элементы.Изготовитель.УстановитьДействие("ПриИзменении", "МодельПриИзменении");
	Элементы.Родитель.УстановитьДействие("ПриИзменении", "МодельПриИзменении");
	Элементы.Переместить(Элементы["гкс_Модель"], Элементы.КодИНаименование,Элементы.Код);
	Элементы.Переместить(Элементы.Наименование, ЭтаФорма,Элементы.НаправлениеИИзготовитель);
	//
	ТипОбъекта_ПриИзмененииНаСервере();
	
	ЗаполнитьДеревоОграничений();
	//
	Элементы.Изготовитель.Видимость = Ложь;
	НЭлем = Элементы.Добавить("гкс_Изготовитель", Тип("ПолеФормы"), Элементы.НаправлениеИИзготовитель);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Заголовок = НСтр("ru='Изготовитель';en='Manufacturer'; es = 'el Fabricador'");
	НЭлем.ПутьКДанным = "Объект.Изготовитель";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	
	// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
	// добавим новую страницу Ответственный и заполним ее
	// Гкс+[TOIR20-204] Селимов от 08.12.2020. Изменено:{
	// ТолькоПросмотр = Истина;
	// }На:{
	КритичностьТолькоПросмотр = Истина;	// } Гкс-[TOIR20-204]
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.гкс_Критичность) Тогда
		КритичностьТолькоПросмотр = Ложь;
	КонецЕсли;
	
	НоваяГруппа = Элементы.Добавить("гкс_Ответственный", Тип("ГруппаФормы"), Элементы.ПанельДопИнформации);
	НоваяГруппа.Заголовок = Нстр("ru='Ответственный'", ОбщегоНазначения.КодОсновногоЯзыка());
	НоваяГруппа.Вид = ВидГруппыФормы.Страница;
	
	НовыйЭлемент = Элементы.Добавить("гкс_ОтветственныйИнженер", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = Нстр("ru='Ответственный инженер'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_ОтветственныйИнженер";
	НовыйЭлемент.ТолькоПросмотр = КритичностьТолькоПросмотр;
	
	НовыйЭлемент = Элементы.Добавить("гкс_Критичность", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = Нстр("ru='Кричичность'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_Критичность";
	НовыйЭлемент.ТолькоПросмотр = КритичностьТолькоПросмотр;
	// } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020. 	

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	ИмяРодителя = Строка(Объект.Родитель);
	гкс_Модель = ИмяРодителя + " / "+Объект.Наименование+?(ЗначениеЗаполнено(Объект.Изготовитель)," / "+Объект.Изготовитель,"")+?(ЗначениеЗаполнено(Объект.Комментарий)," / "+Объект.Комментарий,"");
	Объект.гкс_Модель = гкс_Модель;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъекта_ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта И ВСоставеЕстьОР(Объект.Ссылка) Тогда 
		СтруктураОпОп = Новый Структура("ТипОбъекта,Предыдущий",Объект.ТипОбъекта,ЭтотОбъект["ПредыдущийТипОбъекта"]);
		ОпОп = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеСпискаОР",ЭтотОбъект,СтруктураОпОп);
		МассивКнопок = Новый СписокЗначений();
		// >> [Деснол] [Ушаков А.Д.] [08.11.2019] 
		МассивКнопок.Добавить("Очистить", НСтр("ru = 'Очистить состав'; en = 'Clear composition'; es = 'Limpiar la composición de la'"));
		МассивКнопок.Добавить("Изменить", НСтр("ru = 'Изменить тип'; en = 'To change the type'; es = 'Cambiar el tipo de'"));
		ПоказатьВопрос(ОпОп,НСтр("en='Clean the part of the EI or change the type of all the EI in the squad?';es='Limpiar la composición de los RP o cambiar el tipo de todos los resultados previstos en la composición?';ru='Очистить состав ОР или изменить тип всех ОР в составе?'"),МассивКнопок);
		// << [Деснол] [Ушаков А.Д.] [08.11.2019] 
		Возврат;
	КонецЕсли;
	
	ТекВидимость = Не(Объект.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто"));
	Элементы.НаправлениеИИзготовитель.Видимость = ТекВидимость;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ТекВидимость;
	Элементы["Страница_Ограничения"].Видимость = Не ТекВидимость;
	
	ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта;
КонецПроцедуры

&НаСервере
Процедура ТипОбъекта_ПриИзмененииНаСервере()
	ТекВидимость = Не(Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
	Элементы.НаправлениеИИзготовитель.Видимость = ТекВидимость;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ТекВидимость;
	Элементы["Страница_Ограничения"].Видимость = Не ТекВидимость;
	
	ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеСпискаОР(Результат,ДопПараметры)Экспорт
	Если Результат = "Очистить" Тогда 
		ОчиститьОРНаСервере();
		Элементы.СписокОР.Обновить();
		ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта;
	ИначеЕсли Результат = "Изменить" Тогда 
		ИзменитьТипОР(ДопПараметры.ТипОбъекта, Объект.Ссылка);
		Элементы.СписокОР.Обновить();
		ЭтотОбъект["ПредыдущийТипОбъекта"] = Объект.ТипОбъекта;
	Иначе
		ЭтотОбъект["ПредыдущийТипОбъекта"] = ДопПараметры.Предыдущий;
		Объект.ТипОбъекта = ДопПараметры.Предыдущий;
		Возврат;
	КонецЕсли;
	
	ТипОбъекта_ПриИзменении(Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьТипОР(НовыйТип, ТОР)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.ТиповойОР = &ТОР
		|	И НЕ торо_ОбъектыРемонта.ТипОбъекта = &ТипОбъекта";
	
	Запрос.УстановитьПараметр("ТипОбъекта", НовыйТип);
	Запрос.УстановитьПараметр("ТОР", ТОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ТекОб = Выборка.Ссылка.ПолучитьОбъект();
			ТекОб.ТипОбъекта = НовыйТип;
			ТекОб.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			// >> [Деснол] [Ушаков А.Д.] [08.11.2019] 
			Сообщение.Текст = НСтр("ru = 'Не удалось изменить тип '; en = 'Failed to change the type '; es = 'No se puede cambiar el tipo de '")+Выборка.Ссылка+" : "+ОписаниеОшибки();
			// << [Деснол] [Ушаков А.Д.] [08.11.2019] 
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВСоставеЕстьОР(ТОР)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.ТиповойОР = &ТОР";
	Запрос.УстановитьПараметр("ТОР", ТОР);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоОграничений()

	Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
	Корень.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК ТекИерархия,
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
		|ГДЕ
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ТекИерархия";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка1.Следующий() Цикл
		НоваяСтрока = Корень.Добавить();
		НоваяСтрока.Иерархия = Выборка1.ТекИерархия;
		Ветвь = НоваяСтрока.ПолучитьЭлементы();
		
		Выборка = Выборка1.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока1 = Ветвь.Добавить();
			НоваяСтрока1.Иерархия = Выборка1.ТекИерархия;
			НоваяСтрока1.Ограничение = Выборка.Ограничение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДеревоОграничений(ТекущийОбъект)
	ТекущийОбъект.ОграниченияНаХарактеристикиОборудования.Очистить();
	Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
	Для Каждого СтрокаТаблицы Из Корень Цикл
		Ветвь = СтрокаТаблицы.ПолучитьЭлементы();
		Для Каждого СтрокаТаблицы1 Из Ветвь Цикл
			НоваяСтрока = ТекущийОбъект.ОграниченияНаХарактеристикиОборудования.Добавить();
			НоваяСтрока.Иерархия = СтрокаТаблицы.Иерархия;
			НоваяСтрока.Ограничение = СтрокаТаблицы1.Ограничение;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_Ограничение_ПриИзменении(Элемент)
	ЭтотОбъект["МодифицированностьОграничений"] = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграничений_ПередУдалением(Элемент, Отказ)
	ЭтотОбъект["МодифицированностьОграничений"] = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграничений_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьИерархию(Команда)
	СтруктураОпОп = Новый Структура("МножественныйВыбор",Ложь);
	ОпОп = Новый ОписаниеОповещения("Ограничения_ПослеВыбораИерархии",ЭтотОбъект,);
	ОткрытьФорму("Справочник.торо_СтруктурыОР.ФормаВыбора",СтруктураОпОп,,,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьОграничение(Команда)
	ТекДанные = Элементы["ТаблицаОграничений"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		СтруктураОпОп = Новый Структура("Иерархия",ТекДанные.Иерархия);
		ОпОп = Новый ОписаниеОповещения("Ограничения_ПослеВыбораОграничения",ЭтотОбъект,СтруктураОпОп);
		ОткрытьФорму("Справочник.торо_ОграниченияНаХарактеристикиОбрудования.ФормаВыбора",Новый Структура("МножественныйВыбор",Ложь),,,,,
			ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьОграничениеВсем(Команда)
	
	СтруктураОпОп = Новый Структура("Иерархия",Неопределено);
	ОпОп = Новый ОписаниеОповещения("Ограничения_ПослеВыбораОграничения",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Справочник.торо_ОграниченияНаХарактеристикиОбрудования.ФормаВыбора",Новый Структура("МножественныйВыбор",Ложь),,,,,
		ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ПослеВыбораИерархии(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
		Для Каждого СтрокаТаблицы Из Корень Цикл
			Если СтрокаТаблицы.Иерархия = Результат Тогда 
				Возврат;
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока = Корень.Добавить();
		НоваяСтрока.Иерархия = Результат;
		
		ЭтотОбъект["МодифицированностьОграничений"] = Истина;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ПослеВыбораОграничения(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
		Ветвь = Неопределено;
		Если ДопПараметры.Иерархия = Неопределено Тогда 
			
			Для Каждого СТ Из Корень Цикл
				Если ЗначениеЗаполнено(СТ.Иерархия)=Ложь Тогда 
					Ветвь = СТ.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			Если Ветвь = Неопределено Тогда 
				НоваяСтрока = Корень.Добавить();
				Ветвь = НоваяСтрока.ПолучитьЭлементы();
			КонецЕсли;
		Иначе
			Для Каждого СТ Из Корень Цикл
				Если СТ.Иерархия = ДопПараметры.Иерархия Тогда 
					Ветвь = СТ.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Ветвь = Неопределено Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаМассива Из Ветвь Цикл
			Если СтрокаМассива.Ограничение = Результат Тогда 
				Возврат;
			КонецЕсли;					
		КонецЦикла;
		НоваяСтрока = Ветвь.Добавить();
		НоваяСтрока.Иерархия = ДопПараметры.Иерархия;
		НоваяСтрока.Ограничение = Результат;
		ЭтотОбъект["МодифицированностьОграничений"] = Истина;
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы["ТаблицаОграничений"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекДанные.Ограничение) Тогда 
			ПоказатьЗначение(,ТекДанные.Ограничение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//гкс [Релиз 1] Куст 17.03.2020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [] Деснол 16.08.2022
//&НаКлиенте
//&ИзменениеИКонтроль("НормативныеРемонтыНормативныйРемонтНачалоВыбора")
//Процедура Расш_гкс_НормативныеРемонтыНормативныйРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//КонецПроцедуры
// гкс- [] Деснол 16.08.2022

&НаКлиенте
Процедура Расш_гкс_СписокОРОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивВыбранныхЗначений = Новый Массив;
	ИзменитьНаправлениеИИзготовителя = Неопределено;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") Тогда
			МассивВыбранныхЗначений = ВыбранноеЗначение.ОбъектРемонта;
		КонецЕсли;
		Если ВыбранноеЗначение.Свойство("ИзменитьНаправлениеИИзготовителя")	Тогда
			ИзменитьНаправлениеИИзготовителя = ВыбранноеЗначение.ИзменитьНаправлениеИИзготовителя;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивВыбранныхЗначений = ВыбранноеЗначение;
	Иначе
		МассивВыбранныхЗначений.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	Если МассивВыбранныхЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтруктурЗначений = ПолучитьОбъектыРемонтаСТиповыми(МассивВыбранныхЗначений);
	МассивСтруктурЗначенийОчищенный = Новый Массив;
	ЕстьУжеСТиповым = Ложь;
		
	Для каждого Структура из МассивСтруктурЗначений Цикл
		Если ЗначениеЗаполнено(Структура.ТиповойОР) И Структура.ТиповойОР = Объект.Ссылка Тогда
			ШаблонСообщения = НСтр("es='¡El objeto escogido de la reparación ""%1"" forma parte ya!';ru='Выбранный объект ремонта ""%1"" уже входит в состав!';en='The selected repair item ""%1"" is already included!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Структура.ОбъектРемонта);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Иначе
			МассивСтруктурЗначенийОчищенный.Добавить(Структура);
			
			Если ЗначениеЗаполнено(Структура.ТиповойОР) Тогда
				ЕстьУжеСТиповым = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтруктурЗначенийОчищенный.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// гкс+ [Релиз 1] Куст 17.03.2020
	Если (Объект.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто")) Тогда 
		ИзменитьНаправлениеИИзготовителя = Ложь;
	КонецЕсли;
	// гкс-[Релиз 1] Куст 17.03.2020
	ДопПараметры = Новый Структура("МассивСтруктурОР, ИзменитьНаправлениеИИзготовителя", МассивСтруктурЗначенийОчищенный, ИзменитьНаправлениеИИзготовителя);
	
	Если ЕстьУжеСТиповым Тогда
		Если МассивСтруктурЗначений.Количество() = 1 Тогда
			ШаблонВопроса = НСтр("es='El objeto escogido de la reparación forma parte del objeto tipo de la reparación ""%1"". ¿Llevar el objeto de la reparación?';ru='Выбранный объект ремонта входит в состав типового объекта ремонта ""%1"". Перенести объект ремонта?';en='The selected repair item is part of the typical repair item ""%1"". Relocate a repair item?'");
			ТекстВопроса = СтрШаблон(ШаблонВопроса, МассивСтруктурЗначений[0].ТиповойОР);
		Иначе
			ТекстВопроса = НСтр("es='Algunos de los objetos escogidos de la reparación forman parte de otro objeto tipo de la reparación. ¿Llevar tales objetos de la reparación?';ru='Некоторые из выбранных объектов ремонта входят в состав другого типового объекта ремонта. Перенести такие объекты ремонта?';en='Some of the selected repair objects are part of another typical repair object. Move such repair facilities?'");
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоставОРОбработкаВыбораПослеВопросаОбИзмененииТипового", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		СоставОРОбработкаВыбораПослеВопросаОбИзмененииТипового(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ДобавитьОРВСостав_Завершение")
Процедура Расш_гкс_ДобавитьОРВСостав_Завершение()
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	// гкс+ [Релиз 1] Куст 17.03.2020
	ПараметрыФормы.Вставить("ОтборТипОбъекта",Объект.ТипОбъекта);
	ПараметрыФормы.Вставить("ИспользоватьОтборТипОбъекта",Истина);
	// гкс-[Релиз 1] Куст 17.03.2020
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", ПараметрыФормы, Элементы.СписокОР, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПечатьНаСервере")
Функция Расш_гкс_ПечатьНаСервере()

	ТабДок = Новый ТабличныйДокумент;

	ПолужирныйШрифт = Новый Шрифт("Arial", 9,ИСТИНА,,,);

	ОбластьДляЗаголовка = ТабДок.ПолучитьОбласть(1,2,4,17);
	ОбластьЗаголовок = ОбластьДляЗаголовка.Область(1,2,4,17);
	ОбластьЗаголовок.Объединить();
	ОбластьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	#Удаление
	ОбластьЗаголовок.Текст = НСтр("ru = 'Структура ремонтного цикла'");
	#КонецУдаления
	#Вставка
	ОбластьЗаголовок.Текст = НСтр("es='La estructura del ciclo de reparación';ru='Структура ремонтного цикла';en='Repair cycle structure'");
	#КонецВставки
	ОбластьЗаголовок.Шрифт = Новый Шрифт("Arial", 18, Истина);  
	ОбластьЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ТабДок.Вывести(ОбластьДляЗаголовка);

	ОбластьПараметров = ТабДок.ПолучитьОбласть(6,2,12, 17);

	ОбластьОРЗголовок = ОбластьПараметров.Область(2,2,2,17);
	ОбластьОРЗголовок.Объединить();
	ОбластьОРЗголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОРЗголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьОРЗголовок.Текст = НСтр("ru = 'Типовой объект: '") + Объект.Ссылка;
	#КонецУдаления
	#Вставка
	ОбластьОРЗголовок.Текст = НСтр("es='El objeto tipo: ';ru='Типовой объект: ';en='Typical Object: '") + Объект.Ссылка;
	#КонецВставки
	ОбластьОРЗголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьГрафикЗаголовок = ОбластьПараметров.Область(3,2,3,17);
	ОбластьГрафикЗаголовок.Объединить();
	ОбластьГрафикЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьГрафикЗаголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьГрафикЗаголовок.Текст = НСтр("ru = 'Плановый график работы: '") + ПлановыйГрафикРаботы;
	#КонецУдаления
	#Вставка
	ОбластьГрафикЗаголовок.Текст = НСтр("es='El gráfico planificado del trabajo: ';ru='Плановый график работы: ';en='Scheduled work schedule: '") + ПлановыйГрафикРаботы;
	#КонецВставки
	ОбластьГрафикЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьНормироватьЗаголовок = ОбластьПараметров.Область(4,2,4,17);
	ОбластьНормироватьЗаголовок.Объединить();
	ОбластьНормироватьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьНормироватьЗаголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьНормироватьЗаголовок.Текст = НСтр("ru = 'Нормировать интервалы между ремонтами: '") + ?(Нормировать, НСтр("ru = 'Да'"), НСтр("ru = 'Нет'"));
	#КонецУдаления
	#Вставка
	ОбластьНормироватьЗаголовок.Текст = НСтр("es='Normar los intervalos entre las reparaciones: ';ru='Нормировать интервалы между ремонтами: ';en='Normalize the intervals between repairs: '") + ?(Нормировать, НСтр("es='Sí';ru='Да';en='Yes'"), НСтр("es='No';ru='Нет';en='No'"));
	#КонецВставки

	ОбластьНормироватьЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьВРЗаголовок = ОбластьПараметров.Область(5,2,5,17);
	ОбластьВРЗаголовок.Объединить();
	ОбластьВРЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьВРЗаголовок.Шрифт = ПолужирныйШрифт; 

	СписокВР = Новый СписокЗначений;
	СписокВР.ЗагрузитьЗначения(Объект.НормативныеРемонты.Выгрузить(,"ВидРемонта").ВыгрузитьКолонку("ВидРемонта"));

	ПредставлениеПланируемыхРемонтов = "";
	Для Каждого ПланируемыйВР Из СписокВР Цикл
		ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ПланируемыйВР.Значение);
		ПредставлениеПланируемыхРемонтов = ?(ПредставлениеПланируемыхРемонтов = "", ПредставлениеПланируемыхРемонтов, ПредставлениеПланируемыхРемонтов + "; ") + ПредставлениеВР;
	КонецЦикла;

	ОбластьВРЗаголовок.Текст = "Планируемые виды ремонтов: " + ПредставлениеПланируемыхРемонтов;
	ОбластьВРЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьВРЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьОтображВР = ОбластьПараметров.Область(6,2,6,17);
	ОбластьОтображВР.Объединить();
	ОбластьОтображВР.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОтображВР.Шрифт = ПолужирныйШрифт; 
	ОбластьОтображВР.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьОтображВР.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОтображаемыеВР = Новый СписокЗначений;
	ОтображаемыеВРТекст = "";
	Для Каждого ЗапланированныйРемонт Из ЗапланированныеРемонты Цикл
		Если ЗапланированныйРемонт.Выбран Тогда
			ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ЗапланированныйРемонт.ВидРемонтныхРабот);
			ОтображаемыеВР.Добавить(ЗапланированныйРемонт.ВидРемонтныхРабот, ПредставлениеВР);
			ОтображаемыеВРТекст = ?(ОтображаемыеВРТекст = "", ОтображаемыеВРТекст, ОтображаемыеВРТекст + "; ") + ПредставлениеВР;
		КонецЕсли;
	КонецЦикла;
	ОбластьОтображВР.Текст = "Отображаемые ремонты: " + ОтображаемыеВРТекст;

	ТабДок.Вывести(ОбластьПараметров);

	ПолеМнемосхемы.ИспользоватьСетку = Ложь;
	ГрафСхема = ПолеМнемосхемы.ПолучитьКартинку();
	ПолеМнемосхемы.ИспользоватьСетку = Истина;

	ОбластьКартинка = ТабДок.ПолучитьОбласть(13,2,13,КолвоКолонок+1);
	Рис = Областькартинка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рис.Картинка = ГрафСхема;
	Рис.РазмерКартинки  = РазмерКартинки.Пропорционально;
	Рис.Расположить(ТабДок.Область(2,2,2,КолвоКолонок+1));
	Рис.Высота = (50+ (90*КолСтрокСхемы) + 20)/4;
	Рис.ГраницаСверху = Ложь;
	Рис.ГраницаСлева = Ложь;
	рис.ГраницаСнизу = Ложь;
	Рис.ГраницаСправа = Ложь;

	ТабДок.Вывести(ОбластьКартинка);

	НарисоватьТаблицу(ТабДок);

	Для Каждого Элемент Из ОтображаемыеВР Цикл
		ОбластьРасшифровкаКода = ТабДок.ПолучитьОбласть(ТабДок.ВысотаТаблицы + 1 ,2,	ТабДок.ВысотаТаблицы + 2, 17);
		ОбластьКод = ОбластьРасшифровкаКода.Область(2,2,2, 17);
		ОбластьКод.Объединить();
		ОбластьКод.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьКод.Шрифт = Новый Шрифт("Arial", 9, Ложь);
		ОбластьКод.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьКод.Текст = СокрЛП(Элемент.Значение.Код) + " - " + Элемент.Значение;
		ТабДок.Вывести(ОбластьРасшифровкаКода);
	КонецЦикла;


	ТабДок.ОтображатьСетку = Ложь;
	табДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.КлючПараметровПечати = "торо_РемонтныеГруппы_Визуализация";
	ТабДок.ИмяПараметровПечати = "торо_РемонтныеГруппы_Визуализация";

	Возврат ТабДок;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПерерасчитатьНаСервере")
Функция Расш_гкс_ПерерасчитатьНаСервере(СписокНеНужныхВР)

	ПолеТД.Очистить();
	ПолеТД.АвтоМасштаб = Истина;

	СоответствиеИндексаИНомераКолонки.Очистить();

	Для каждого ЭлемСписка Из СписокНеНужныхВР Цикл

		МассивСтрок = ТаблицаОбъектыРемонта.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ЭлемСписка.Значение));

		Если МассивСтрок.Количество() Тогда
			ТаблицаОбъектыРемонта.Удалить(МассивСтрок[0]);
		КонецЕсли;

	КонецЦикла;

	СтруктураПарНаработки = ПолучитьТаблицуПараметровНаработки(Объект.Ссылка, Объект.Родитель);
	ВчерашняяДата = НачалоДня(ТекущаяДатаСеанса()-24*3600);

	ТабПараметрыНаработкиОбъектовРемонта.Очистить();

	Для каждого Элем Из СтруктураПарНаработки Цикл
		НС = ТабПараметрыНаработкиОбъектовРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
		Если НС.ОбъектРемонта = Объект.Ссылка Тогда
			НС.Период = ВчерашняяДата;
		КонецЕсли;
	КонецЦикла;

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаПланРемонтов", Документы.торо_ПланГрафикРемонта.ПустаяСсылка().ПланРемонтов.ВыгрузитьКолонки());
	СтруктураДанных.Вставить("ТаблицаОбъектыРемонта", ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ОбъектРемонтныхРабот,ВидРемонтныхРабот,ПлановыйГрафикРаботы,РемонтнаяГруппа"));
	СтруктураДанных.Вставить("ДатаПланирования", НачалоДня(ТекущаяДата()));
	СтруктураДанных.Вставить("ПериодичностьДетализации", Перечисления.Периодичность.Год);
	СтруктураДанных.Вставить("КоличествоПериодов", 1);
	СтруктураДанных.Вставить("ТабПараметрыНаработкиОбъектовРемонта", ТабПараметрыНаработкиОбъектовРемонта.Выгрузить());
	СтруктураДанных.Вставить("ВРНачалоЦикла", ВРНачалоЦикла);
	СтруктураДанных.Вставить("ВизуализацияТипОР", Истина);

	ТабНормативов = Новый ТаблицаЗначений;
	СтруктураДанных.Вставить("ТаблицаНормативов", ТабНормативов);

	// Для совместимости с расчетом ППР создаем пустую таблицу
	ТаблицаЦепочки = Новый ТаблицаЗначений;
	ТаблицаЦепочки.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаЦепочки.Колонки.Добавить("Цепочка",              Новый ОписаниеТипов("СправочникСсылка.торо_ЦепочкиРемонта"));

	СтруктураДанных.Вставить("ТаблицаЦепочки", ТаблицаЦепочки);

	ВыполнятьРасчет = ПроверкаПередРасчетом(СтруктураДанных["ДатаПланирования"], ТаблицаОбъектыРемонта.Выгрузить().Скопировать(, "ОбъектРемонтныхРабот, ВидРемонтныхРабот"), СтруктураДанных["ТабПараметрыНаработкиОбъектовРемонта"]);

	Если ВыполнятьРасчет Тогда

		СтруктураДанных.Вставить("ДатаОкончанияВизуализации", ДатаПланированияОкончание);

		ТабРемонтов = торо_РасчетППР.РасчетППР(Неопределено,,,СтруктураДанных);

		Если ТабРемонтов = Ложь или ТабРемонтов.Количество() = 0 Тогда
			#Удаление
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='¡No consiguió contar el ciclo de reparación, comprueben los ajustes de la planificación!';ru='Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!';en='Failed to calculate repair cycle, check planning settings!'");
			#КонецВставки
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		Иначе
			ТаблицаРемонтов.Загрузить(ТабРемонтов);
		КонецЕсли;

		ТаблицаНормативов.Загрузить(СтруктураДанных.ТаблицаНормативов);

		ТаблицаРемонтов.Сортировать("ДатаНач");

		СтрокиНачало = ТаблицаРемонтов.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ВРНачалоЦикла));
		Если СтрокиНачало.Количество() > 0 Тогда
			СтрНачало = СтрокиНачало[0];
			ИндексНачало = ТаблицаРемонтов.Индекс(СтрНачало);
			Пока ИндексНачало > 0 Цикл
				ТаблицаРемонтов.Удалить(0);
				ИндексНачало = ИндексНачало - 1;
			КонецЦикла;
		КонецЕсли;

		КоличествоРемонтов = ТаблицаРемонтов.Количество();
		Пока КоличествоРемонтов > 0 Цикл
			Если ТаблицаРемонтов[КоличествоРемонтов - 1].ВидРемонтныхРабот = ВРНачалоЦикла Тогда
				Прервать;
			Иначе
				ТаблицаРемонтов.Удалить(КоличествоРемонтов - 1);
				КоличествоРемонтов = КоличествоРемонтов - 1;
			КонецЕсли;
		КонецЦикла;


		Если ТаблицаРемонтов.Количество() > 0 Тогда

			ЗапланРемонты = ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ВидРемонтныхРабот");

			Массив = Новый Массив;
			Массив.Добавить(Тип("Булево"));
			ОписаниеТиповБул = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Выбран",ОписаниеТиповБул);
			Массив = Новый Массив;
			Массив.Добавить(Тип("Цвет"));
			ОписаниеТиповЦвет = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Цвет",ОписаниеТиповЦвет);
			ЗапланРемонты.ЗаполнитьЗначения(Истина,"Выбран");
			ЗапланРемонты.ЗаполнитьЗначения(Новый Цвет(255, 255, 255) ,"Цвет");

			Нормировать = Ложь;

		Иначе
			#Удаление
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='¡No consiguió contar el ciclo de reparación, comprueben los ajustes de la planificación!';ru='Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!';en='Failed to calculate repair cycle, check planning settings!'");
			#КонецВставки
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;

		КонецЕсли;



		ТаблицаРемонтовВизуализация.Загрузить(ТаблицаРемонтов.Выгрузить().Скопировать());
		РассчитатьПараметрыОтПредыдущего();

		Если ТаблицаРемонтов.Количество() > 0 Тогда
			ПоследнийРемонт = ТаблицаРемонтов[ТаблицаРемонтов.Количество() - 1];
			ДатаПоследнего = ТаблицаРемонтов[0].ДатаНач;
			ОбщаяПродолжительность = ПоследнийРемонт.ДатаНач - ДатаПоследнего;


			Если ОбщаяПродолжительность = 0 Тогда
				ОбщаяПродолжительность = 1;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ПроверитьЗаполнениеСтрокиНормативногоРемонта")
Функция Расш_гкс_ПроверитьЗаполнениеСтрокиНормативногоРемонта(ТекущиеДанные)

	ТекстОшибки = "";

	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидРемонта) Тогда
		#Удаление
		ТекстОшибки = НСтр("ru = 'Укажите вид ремонта.'");
		#КонецУдаления
		#Вставка
		ТекстОшибки = НСтр("es='Indiquen el tipo de la reparación.';ru='Укажите вид ремонта.';en='Specify the type of repair.'");
		#КонецВставки
	Иначе
		Строки = Объект.НормативныеРемонты.НайтиСтроки(Новый Структура("ВидРемонта",ТекущиеДанные.ВидРемонта));
		Если Строки.Количество()> 1 Тогда
			#Удаление
			ТекстОшибки = НСтр("ru = 'Данный вид ремонта уже указан в другой строке.'");
			#КонецУдаления
			#Вставка
			ТекстОшибки = НСтр("es='El tipo dado de la reparación es indicado ya en otra línea.';ru='Данный вид ремонта уже указан в другой строке.';en='This type of repair is already indicated on another line.'");
			#КонецВставки
		Конецесли;
	КонецЕсли;

	Возврат ТекстОшибки;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьИзображение")
Процедура Расш_гкс_ДобавитьИзображение(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		#Удаление
		ТекстВопроса = НСтр("ru='Для выбора изображения необходимо записать объект. Записать?'");
		#КонецУдаления
		#Вставка
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';
		|ru='Для выбора изображения необходимо записать объект. Записать?';
		|en='To select an image, an object must be recorded. To record?'");
		#КонецВставки
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ДобавитьИзображениеФрагмент();

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьИзображениеНаКлиенте")
Процедура Расш_гкс_ДобавитьИзображениеНаКлиенте()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		#Удаление
		ТекстВопроса = НСтр("ru='Для выбора изображения необходимо записать объект. Записать?'");
		#КонецУдаления
		#Вставка
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';
		|ru='Для выбора изображения необходимо записать объект. Записать?';
		|en='To select an image, an object must be recorded. To record?'");
		#КонецВставки
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеНаКлиентеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ДобавитьИзображениеНаКлиентеФрагмент();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВычислениеМежремонтногоИнтервала")
Функция Расш_гкс_ВычислениеМежремонтногоИнтервала(ТекДанные)

	Перем МежремонтныйИнтервал;
	
	Запрос = Новый Запрос;
	Таб = Объект.НормативныеРемонты.Выгрузить(,"ВидРемонта, СпособПланирования");
	Запрос.УстановитьПараметр("Таб", Таб);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.СпособПланирования
	|ПОМЕСТИТЬ ОпредСпособПланирования
	|ИЗ
	|	&Таб КАК Таб
	|ГДЕ
	|	Таб.ВидРемонта = &ВидРемонта
	|	И Таб.СпособПланирования <>ЗНАЧЕНИЕ(Справочник.торо_СпособыПланированияРемонтныхРабот.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПараметрыНаработки,
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПериодичность,
	|	торо_СпособыПланированияРемонтныхРабот.КоличествоПериодов,
	|	торо_СпособыПланированияРемонтныхРабот.ПериодичностьРемонтныхРабот КАК Периодичность,
	|	ОпредСпособПланирования.СпособПланирования КАК СпособПланирования
	|ИЗ
	|	ОпредСпособПланирования КАК ОпредСпособПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_СпособыПланированияРемонтныхРабот КАК торо_СпособыПланированияРемонтныхРабот
	|		ПО ОпредСпособПланирования.СпособПланирования = торо_СпособыПланированияРемонтныхРабот.Ссылка";


	Запрос.УстановитьПараметр("ВидРемонта", ТекДанные.ЗамещаемыйВидРемонта);

	Результат = Запрос.Выполнить();

	ВыборкаДляПериодичности = Результат.Выбрать();

	Если ВыборкаДляПериодичности.Следующий() Тогда

		Если ВыборкаДляПериодичности.ИспользоватьПериодичность Тогда

			Если ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Год Тогда
				Период = 365;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Полугодие Тогда
				Период = 182;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Квартал Тогда
				Период = 90;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Месяц Тогда
				Период = 28;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Декада Тогда
				Период = 10;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Неделя Тогда
				Период = 7;
			Иначе Период = 1;
			КонецЕсли;

			МежремонтныйИнтервал = ВыборкаДляПериодичности.КоличествоПериодов * Период;

		КонецЕсли;

		Если ВыборкаДляПериодичности.ИспользоватьПараметрыНаработки Тогда

			Запрос3 = Новый Запрос;

			Если СписокПараметровНаработки.Количество() > 0 Тогда

				ТаблНараб = СписокПараметровНаработки.Выгрузить(, "ОбъектРемонта,Показатель,ПродолжительностьПериодаПлановойНаработки,ПериодПлановойНаработки,ПлановаяНаработка,КоэффициентИспользованияОборудования"); 

			Иначе

				СписокОтбора = Новый СписокЗначений;
				СписокОтбора.Добавить(Объект.Ссылка);

				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки
				|ИЗ
				|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
				|ГДЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта В(&СписокОтбора)";

				Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);

				Результат = Запрос.Выполнить();
				ТаблНараб = Результат.Выгрузить();

			КонецЕсли;

			Запрос3.УстановитьПараметр("ТаблНараб", ТаблНараб);


			Запрос3.Текст = 
			"ВЫБРАТЬ
			|	ТаблНараб.Показатель,
			|	ТаблНараб.ПродолжительностьПериодаПлановойНаработки,
			|	ТаблНараб.ПериодПлановойНаработки,
			|	ТаблНараб.ПлановаяНаработка * ТаблНараб.КоэффициентИспользованияОборудования КАК ПлановаяНаработка
			|ПОМЕСТИТЬ ВыбрПараметрыНаработки
			|ИЗ
			|	&ТаблНараб КАК ТаблНараб
			|ГДЕ
			|	ТаблНараб.ОбъектРемонта = &ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ЗначениеПараметраНаработки,
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ПараметрНаработки
			|ПОМЕСТИТЬ ВыбрСпобобыПланирования
			|ИЗ
			|	Справочник.торо_СпособыПланированияРемонтныхРабот.ПараметрыНаработки КАК торо_СпособыПланированияРемонтныхРаботПараметрыНаработки
			|ГДЕ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыбрСпобобыПланирования.ЗначениеПараметраНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки,0) КАК ПродолжительностьПериодаПлановойНаработки,
			|	ВыбрПараметрыНаработки.ПериодПлановойНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПлановаяНаработка,0) КАК ПлановаяНаработка
			|ИЗ
			|	ВыбрСпобобыПланирования КАК ВыбрСпобобыПланирования
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбрПараметрыНаработки КАК ВыбрПараметрыНаработки
			|		ПО ВыбрСпобобыПланирования.ПараметрНаработки = ВыбрПараметрыНаработки.Показатель";


			Запрос3.УстановитьПараметр("Ссылка", ВыборкаДляПериодичности.СпособПланирования);
			Запрос3.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

			Результат = Запрос3.Выполнить();

			ВыборкаДляНаработки = Результат.Выбрать();
			ВыборкаДляНаработки.Следующий();

			Если ВыборкаДляНаработки.ПлановаяНаработка > 0 И ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки > 0 Тогда


				Если ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Год Тогда
					ПериодПлановойНаработки = 365;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Полугодие Тогда
					ПериодПлановойНаработки = 183;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Квартал Тогда
					ПериодПлановойНаработки = 90;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Месяц Тогда
					ПериодПлановойНаработки = 30;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Декада Тогда
					ПериодПлановойНаработки = 10;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Неделя Тогда
					ПериодПлановойНаработки = 7;
				Иначе ПериодПлановойНаработки = 1;
				КонецЕсли;

				ПериодВДнях = ПериодПлановойНаработки * ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки;
				ПланНарабВДень = ВыборкаДляНаработки.ПлановаяНаработка / ПериодВДнях;

				МежремИнтервал = ВыборкаДляНаработки.ЗначениеПараметраНаработки / ПланНарабВДень;
				Если ЗначениеЗаполнено(МежремонтныйИнтервал) Тогда
					Если МежремИнтервал < МежремонтныйИнтервал Тогда
						МежремонтныйИнтервал = МежремИнтервал;
					КонецЕсли;
				Иначе МежремонтныйИнтервал = МежремИнтервал;
				КонецЕсли;
			Иначе
				#Удаление
				ШаблонСообщения = НСтр("ru = 'Проверьте заполнение показателей на вкладке ""Наработка"", Параметров планирования по наработке в способе планирования %1'");
				#КонецУдаления
				#Вставка
			ШаблонСообщения = НСтр("es='Comprueben el relleno de los índices en вкладке ""la Elaboración"", los Parámetros "
			+ "de la planificación por la elaboración en el modo de la planificación %1';ru='Проверьте заполнение показателей "
			+ "на вкладке ""Наработка"", Параметров планирования по наработке в способе планирования %1';en='Check the filling "
			+ "of indicators on the tab ""Timing” of the Operating time planning parameters in the planning method%1'");
				#КонецВставки
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДляПериодичности.СпособПланирования);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;


	Иначе
		#Удаление
		ТекстСообщения = НСтр("ru = 'Проверьте заполнение ""Способ планирования""'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='Comprueben el relleno ""el Modo de la planificación""';ru='Проверьте заполнение ""Способ планирования""';en='Check the ""Planning method"" filling'");
		#КонецВставки
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	Возврат МежремонтныйИнтервал;
КонецФункции

// гкс+ [Релиз 1] Куст 20.01.2021
&НаКлиенте
Процедура Расш_гкс_ПриОткрытииВместо(Отказ)
	
	// Гкс-[TOIR20-300] Пономарёв С.О. от 29.12.2021. Изменено:{
	// было:
	//Если Объект.ЭтоГруппа И РольДоступнаНаСервере("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
	// стало:	
	Если Объект.ЭтоГруппа И РольДоступнаНаСервере("гкс_ЗапретРедактированиеКлассовТиповыхОР") и НЕ РольДоступнаНаСервере("гкс_ДобавлениеТиповыхОР") Тогда 
		// } Гкс-[TOIR20-300] Пономарёв С.О. от 29.12.20211.
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Недостаточно прав';en='Not enough rights';es='No hay suficientes derechos'");
		Сообщение.Сообщить();
		Закрыть();
	КонецЕсли;
	ПриОткрытии(Отказ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаНаСервере(Имя)
	Возврат РольДоступна(Имя);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНормативныеРемонты

&НаКлиенте
&ИзменениеИКонтроль("НормативныеРемонтыПередОкончаниемРедактирования")
Процедура гкс_НормативныеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
		
	Если НЕ ОтменаРедактирования Тогда
		// проверка
		ТекстОшибки = ПроверитьЗаполнениеСтрокиНормативногоРемонта(ТекДанные);
		
		Если ТекстОшибки <> "" Тогда
			НомерСтроки = Объект.НормативныеРемонты.Индекс(ТекДанные);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Объект.НормативныеРемонты["+НомерСтроки+"].ВидРемонта",, Отказ);
		КонецЕсли;
		
		#Удаление
		Если Не Отказ И Не НоваяСтрока И СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено
		#КонецУдаления
		#Вставка
		// гкс+ [Релиз 1] Куст 18.02.2021
		Если Не Отказ И Не НоваяСтрока И Не СтруктураДанныхДоРедактирования = Неопределено
			И СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено
			// гкс- [Релиз 1] Куст 18.02.2021
		#КонецВставки
			И СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта <> ТекДанные.ВидРемонта Тогда
			
			НайденныеСтроки = Объект.ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			НайденныеСтроки = Объект.ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ПредшествующийВидРемонта", СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ПредшествующийВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			
			НайденныеСтроки = Объект.ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			НайденныеСтроки = Объект.ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ЗамещаемыйВидРемонта", СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ЗамещаемыйВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			
			НормативныеРемонтыПриАктивизацииСтроки(Элемент);
		КонецЕсли;
		
	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		#Вставка
		// гкс+ [Релиз 1] Куст 18.02.2021
		Если ТипЗнч(СтруктураДанныхДоРедактирования) = Тип("Структура") И СтруктураДанныхДоРедактирования.Свойство(Элемент.Имя) Тогда 
		#КонецВставки
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
		#Вставка
		КонецЕсли;
		// гкс- [Релиз 1] Куст 18.02.2021
		#КонецВставки
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
